{
  "_name_or_path": "neuralmind/bert-base-portuguese-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "",
    "1": "Gender=Masc|Number=Sing",
    "2": "Gender=Fem|Number=Sing",
    "3": "Gender=Masc|Number=Plur",
    "4": "Gender=Fem|Number=Plur",
    "5": "Mood=Ind|Number=Sing|Person=3|Tense=Pres",
    "6": "_+Gender=Masc|Number=Sing",
    "7": "_+Gender=Fem|Number=Sing",
    "8": "VerbForm=Inf",
    "9": "Mood=Ind|Number=Sing|Person=3|Tense=Past",
    "10": "Mood=Ind|Number=Plur|Person=3|Tense=Pres",
    "11": "_+Gender=Masc|Number=Plur",
    "12": "Person=3",
    "13": "_+Gender=Fem|Number=Plur",
    "14": "Tense=Imp|Mood=Ind|Person=3|Number=Sing",
    "15": "Number=Plur",
    "16": "Mood=Ind|Number=Plur|Person=3|Tense=Past",
    "17": "Number=Sing",
    "18": "Gender=Masc|Number=Sing|Person=3",
    "19": "VerbForm=Ger",
    "20": "Mood=Ind|Number=Sing|Person=1|Tense=Pres",
    "21": "Mood=Ind|Number=Sing|Person=3|Tense=Fut",
    "22": "VerbForm=Part",
    "23": "Gender=Masc|Number=Sing|Person=1",
    "24": "Tense=Imp|Mood=Ind|Person=3|Number=Plur",
    "25": "Mood=Ind|Number=Sing|Person=1|Tense=Past",
    "26": "Mood=Ind|Number=Plur|Person=1|Tense=Pres",
    "27": "Gender=Fem|Number=Sing|Person=3",
    "28": "Mood=Sub|Number=Sing|Person=3|Tense=Pres",
    "29": "Number=Sing|Person=3|VerbForm=Inf",
    "30": "Mood=Cnd|Number=Sing|Person=3",
    "31": "Tense=Pqp|Mood=Ind|Person=3|Number=Sing",
    "32": "Gender=Masc|Number=Plur|Person=3",
    "33": "Mood=Ind|Number=Plur|Person=3|Tense=Fut",
    "34": "Tense=Imp|Mood=Sub|Person=3|Number=Sing",
    "35": "Mood=Ind|Number=Sing|Person=2|Tense=Pres",
    "36": "Number=Sing|Person=3",
    "37": "Number=Plur|Person=3|VerbForm=Inf",
    "38": "Mood=Sub|Number=Plur|Person=3|Tense=Pres",
    "39": "Number=Sing|Person=1",
    "40": "Tense=Imp|Mood=Ind|Person=1|Number=Sing",
    "41": "Gender=Masc|Number=Plur|Person=1",
    "42": "Gender=Fem|Number=Sing|Person=1",
    "43": "Mood=Imp|Person=2|Number=Sing",
    "44": "Gender=Masc|Number=Sing|Person=2",
    "45": "Mood=Ind|Number=Plur|Person=1|Tense=Past",
    "46": "Gender=Masc|Number=Sing|Degree=Abs",
    "47": "Gender=Fem|Number=Plur|Person=3",
    "48": "Mood=Cnd|Number=Plur|Person=3",
    "49": "Degree=Cmp|Gender=Fem|Number=Sing",
    "50": "Gender=Fem|Number=Sing|Person=2",
    "51": "Mood=Sub|Number=Sing|Person=3|Tense=Fut",
    "52": "Gender=Masc|Number=Sing|Degree=Cmp",
    "53": "Degree=Abs|Gender=Fem|Number=Sing",
    "54": "Tense=Imp|Mood=Sub|Person=3|Number=Plur",
    "55": "_+Gender=Masc|Number=Sing|Person=3",
    "56": "_+Gender=Masc|Number=Plur|Person=3",
    "57": "Tense=Imp|Mood=Ind|Person=1|Number=Plur",
    "58": "Number=Plur|Person=1",
    "59": "Mood=Ind|Number=Sing|Person=2|Tense=Past",
    "60": "_+Gender=Fem|Number=Sing|Person=3",
    "61": "Number=Sing|Degree=Cmp",
    "62": "Number=Plur|Person=1|VerbForm=Inf",
    "63": "Mood=Sub|Number=Plur|Person=3|Tense=Fut",
    "64": "Mood=Ind|Number=Plur|Person=1|Tense=Fut",
    "65": "Number=Sing|Person=1|VerbForm=Inf",
    "66": "Mood=Imp|Person=2|Number=Plur",
    "67": "Mood=Cnd|Number=Sing|Person=1",
    "68": "Mood=Ind|Number=Sing|Person=1|Tense=Fut",
    "69": "Gender=Masc|Number=Plur|Degree=Abs",
    "70": "Gender=Masc|Number=Plur|Degree=Cmp",
    "71": "Tense=Imp|Mood=Ind|Person=2|Number=Sing",
    "72": "Mood=Sub|Number=Plur|Person=1|Tense=Pres",
    "73": "Tense=Imp|Mood=Sub|Person=1|Number=Sing",
    "74": "_+Gender=Fem|Number=Plur|Person=3",
    "75": "Number=Sing|Person=2|VerbForm=Inf",
    "76": "Gender=Masc|Number=Plur|Person=2",
    "77": "Tense=Pqp|Mood=Ind|Person=1|Number=Sing",
    "78": "Mood=Cnd|Number=Plur|Person=1",
    "79": "Mood=Sub|Number=Sing|Person=1|Tense=Pres",
    "80": "Mood=Sub|Number=Sing|Person=2|Tense=Pres",
    "81": "Number=Plur|Degree=Cmp",
    "82": "Degree=Abs|Gender=Fem|Number=Plur",
    "83": "Degree=Cmp|Gender=Fem|Number=Plur",
    "84": "Mood=Sub|Number=Sing|Person=2|Tense=Fut",
    "85": "Number=Sing|Person=2",
    "86": "Tense=Imp|Mood=Sub|Person=1|Number=Plur",
    "87": "Mood=Sub|Number=Plur|Person=1|Tense=Fut",
    "88": "Tense=Imp|Mood=Sub|Person=2|Number=Sing",
    "89": "_+Gender=Masc|Number=Sing|Person=1",
    "90": "Mood=Ind|Number=Sing|Person=2|Tense=Fut",
    "91": "Mood=Sub|Number=Sing|Person=1|Tense=Fut",
    "92": "_+Gender=Masc|Number=Sing|Person=2",
    "93": "Mood=Sub|Number=Plur|Person=2|Tense=Pres",
    "94": "Gender=Fem|Number=Plur|Person=1",
    "95": "Number=Plur|Person=3",
    "96": "_+Gender=Masc|Number=Plur|Person=1",
    "97": "Gender=Masc|Number=Sing|Person=3+Gender=Masc|Number=Sing|Person=3",
    "98": "Gender=Fem|Number=Plur|Person=2",
    "99": "Mood=Cnd|Number=Sing|Person=2",
    "100": "Mood=Ind|Number=Plur|Person=2|Tense=Pres",
    "101": "_+Gender=Fem|Number=Sing|Person=1",
    "102": "Gender=Masc",
    "103": "Gender=Masc|Number=Sing|Person=1+Gender=Masc|Number=Sing|Person=3",
    "104": "_+Number=Sing|Person=1",
    "105": "Gender=Fem|Number=Sing|Person=3+Gender=Masc|Number=Sing|Person=3",
    "106": "_+Gender=Fem|Number=Sing|Person=2",
    "107": "Gender=Fem|Number=Sing|Person=3+Gender=Fem|Number=Sing|Person=3",
    "108": "Number=Plur|Person=2",
    "109": "Tense=Pqp|Mood=Ind|Person=1|Number=Plur",
    "110": "Gender=Masc|Number=Sing|Person=1+Gender=Fem|Number=Sing|Person=3",
    "111": "Gender=Masc|Number=Sing|Person=2+Gender=Masc|Number=Sing|Person=3",
    "112": "Gender=Masc|Number=Sing|Person=3+Gender=Fem|Number=Sing|Person=3",
    "113": "Mood=Ind|Number=Plur|Person=2|Tense=Fut",
    "114": "_+Number=Plur|Person=1",
    "115": "Gender=Fem|Number=Sing|Person=2+Gender=Fem|Number=Sing|Person=3",
    "116": "Gender=Fem|Number=Sing|Person=2+Gender=Masc|Number=Sing|Person=3",
    "117": "Gender=Masc|Number=Sing|Person=1+Gender=Masc|Number=Plur|Person=3",
    "118": "_+Number=Sing|Person=3",
    "119": "Gender=Fem|Number=Sing|Person=1+Gender=Masc|Number=Sing|Person=3",
    "120": "Gender=Fem|Number=Sing|Person=3+Gender=Fem|Number=Plur|Person=3",
    "121": "Gender=Masc|Number=Sing|Person=1+Gender=Masc|Number=Sing",
    "122": "Mood=Imp|Person=1|Number=Plur",
    "123": "Number=Plur|Person=2|VerbForm=Inf",
    "124": "Number=Sing|Degree=Abs",
    "125": "Number=Sing|Person=1+Gender=Fem|Number=Sing|Person=3",
    "126": "_+Gender=Masc|Number=Plur|Person=2",
    "127": "Gender=Fem|Number=Sing+Gender=Fem|Number=Sing",
    "128": "Gender=Fem|Number=Sing|Person=2+Gender=Fem|Number=Plur|Person=3",
    "129": "Gender=Fem|Number=Sing|Person=3+Gender=Masc|Number=Plur|Person=3",
    "130": "Gender=Fem|Number=Sing|Person=3+Gender=Masc|Number=Sing",
    "131": "Gender=Masc|Number=Sing|Person=1+Gender=Fem|Number=Sing",
    "132": "Gender=Masc|Number=Sing|Person=2+Gender=Fem|Number=Sing|Person=3",
    "133": "Gender=Masc|Number=Sing|Person=3+Gender=Fem|Number=Plur|Person=3",
    "134": "Gender=Masc|Number=Sing|Person=3+Gender=Fem|Number=Sing",
    "135": "Gender=Masc|Number=Sing|Person=3+Gender=Masc|Number=Plur|Person=3",
    "136": "Gender=Masc|Number=Sing|Person=3+Gender=Masc|Number=Sing",
    "137": "Mood=Cnd|Number=Plur|Person=2",
    "138": "Mood=Ind|Number=Plur|Person=2|Tense=Past",
    "139": "Number=Sing|Person=1+Gender=Masc|Number=Sing|Person=3",
    "140": "Number=Sing|Person=3+Gender=Fem|Number=Sing|Person=3",
    "141": "Number=Sing|Person=3+Gender=Masc|Number=Sing|Person=3",
    "142": "Tense=Pqp|Mood=Ind|Person=3|Number=Plur",
    "143": "_+Gender=Fem|Number=Plur|Person=1",
    "144": "_+Number=Plur|Person=2",
    "145": "_+Number=Sing|Person=2"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "": 0,
    "Degree=Abs|Gender=Fem|Number=Plur": 82,
    "Degree=Abs|Gender=Fem|Number=Sing": 53,
    "Degree=Cmp|Gender=Fem|Number=Plur": 83,
    "Degree=Cmp|Gender=Fem|Number=Sing": 49,
    "Gender=Fem|Number=Plur": 4,
    "Gender=Fem|Number=Plur|Person=1": 94,
    "Gender=Fem|Number=Plur|Person=2": 98,
    "Gender=Fem|Number=Plur|Person=3": 47,
    "Gender=Fem|Number=Sing": 2,
    "Gender=Fem|Number=Sing+Gender=Fem|Number=Sing": 127,
    "Gender=Fem|Number=Sing|Person=1": 42,
    "Gender=Fem|Number=Sing|Person=1+Gender=Masc|Number=Sing|Person=3": 119,
    "Gender=Fem|Number=Sing|Person=2": 50,
    "Gender=Fem|Number=Sing|Person=2+Gender=Fem|Number=Plur|Person=3": 128,
    "Gender=Fem|Number=Sing|Person=2+Gender=Fem|Number=Sing|Person=3": 115,
    "Gender=Fem|Number=Sing|Person=2+Gender=Masc|Number=Sing|Person=3": 116,
    "Gender=Fem|Number=Sing|Person=3": 27,
    "Gender=Fem|Number=Sing|Person=3+Gender=Fem|Number=Plur|Person=3": 120,
    "Gender=Fem|Number=Sing|Person=3+Gender=Fem|Number=Sing|Person=3": 107,
    "Gender=Fem|Number=Sing|Person=3+Gender=Masc|Number=Plur|Person=3": 129,
    "Gender=Fem|Number=Sing|Person=3+Gender=Masc|Number=Sing": 130,
    "Gender=Fem|Number=Sing|Person=3+Gender=Masc|Number=Sing|Person=3": 105,
    "Gender=Masc": 102,
    "Gender=Masc|Number=Plur": 3,
    "Gender=Masc|Number=Plur|Degree=Abs": 69,
    "Gender=Masc|Number=Plur|Degree=Cmp": 70,
    "Gender=Masc|Number=Plur|Person=1": 41,
    "Gender=Masc|Number=Plur|Person=2": 76,
    "Gender=Masc|Number=Plur|Person=3": 32,
    "Gender=Masc|Number=Sing": 1,
    "Gender=Masc|Number=Sing|Degree=Abs": 46,
    "Gender=Masc|Number=Sing|Degree=Cmp": 52,
    "Gender=Masc|Number=Sing|Person=1": 23,
    "Gender=Masc|Number=Sing|Person=1+Gender=Fem|Number=Sing": 131,
    "Gender=Masc|Number=Sing|Person=1+Gender=Fem|Number=Sing|Person=3": 110,
    "Gender=Masc|Number=Sing|Person=1+Gender=Masc|Number=Plur|Person=3": 117,
    "Gender=Masc|Number=Sing|Person=1+Gender=Masc|Number=Sing": 121,
    "Gender=Masc|Number=Sing|Person=1+Gender=Masc|Number=Sing|Person=3": 103,
    "Gender=Masc|Number=Sing|Person=2": 44,
    "Gender=Masc|Number=Sing|Person=2+Gender=Fem|Number=Sing|Person=3": 132,
    "Gender=Masc|Number=Sing|Person=2+Gender=Masc|Number=Sing|Person=3": 111,
    "Gender=Masc|Number=Sing|Person=3": 18,
    "Gender=Masc|Number=Sing|Person=3+Gender=Fem|Number=Plur|Person=3": 133,
    "Gender=Masc|Number=Sing|Person=3+Gender=Fem|Number=Sing": 134,
    "Gender=Masc|Number=Sing|Person=3+Gender=Fem|Number=Sing|Person=3": 112,
    "Gender=Masc|Number=Sing|Person=3+Gender=Masc|Number=Plur|Person=3": 135,
    "Gender=Masc|Number=Sing|Person=3+Gender=Masc|Number=Sing": 136,
    "Gender=Masc|Number=Sing|Person=3+Gender=Masc|Number=Sing|Person=3": 97,
    "Mood=Cnd|Number=Plur|Person=1": 78,
    "Mood=Cnd|Number=Plur|Person=2": 137,
    "Mood=Cnd|Number=Plur|Person=3": 48,
    "Mood=Cnd|Number=Sing|Person=1": 67,
    "Mood=Cnd|Number=Sing|Person=2": 99,
    "Mood=Cnd|Number=Sing|Person=3": 30,
    "Mood=Imp|Person=1|Number=Plur": 122,
    "Mood=Imp|Person=2|Number=Plur": 66,
    "Mood=Imp|Person=2|Number=Sing": 43,
    "Mood=Ind|Number=Plur|Person=1|Tense=Fut": 64,
    "Mood=Ind|Number=Plur|Person=1|Tense=Past": 45,
    "Mood=Ind|Number=Plur|Person=1|Tense=Pres": 26,
    "Mood=Ind|Number=Plur|Person=2|Tense=Fut": 113,
    "Mood=Ind|Number=Plur|Person=2|Tense=Past": 138,
    "Mood=Ind|Number=Plur|Person=2|Tense=Pres": 100,
    "Mood=Ind|Number=Plur|Person=3|Tense=Fut": 33,
    "Mood=Ind|Number=Plur|Person=3|Tense=Past": 16,
    "Mood=Ind|Number=Plur|Person=3|Tense=Pres": 10,
    "Mood=Ind|Number=Sing|Person=1|Tense=Fut": 68,
    "Mood=Ind|Number=Sing|Person=1|Tense=Past": 25,
    "Mood=Ind|Number=Sing|Person=1|Tense=Pres": 20,
    "Mood=Ind|Number=Sing|Person=2|Tense=Fut": 90,
    "Mood=Ind|Number=Sing|Person=2|Tense=Past": 59,
    "Mood=Ind|Number=Sing|Person=2|Tense=Pres": 35,
    "Mood=Ind|Number=Sing|Person=3|Tense=Fut": 21,
    "Mood=Ind|Number=Sing|Person=3|Tense=Past": 9,
    "Mood=Ind|Number=Sing|Person=3|Tense=Pres": 5,
    "Mood=Sub|Number=Plur|Person=1|Tense=Fut": 87,
    "Mood=Sub|Number=Plur|Person=1|Tense=Pres": 72,
    "Mood=Sub|Number=Plur|Person=2|Tense=Pres": 93,
    "Mood=Sub|Number=Plur|Person=3|Tense=Fut": 63,
    "Mood=Sub|Number=Plur|Person=3|Tense=Pres": 38,
    "Mood=Sub|Number=Sing|Person=1|Tense=Fut": 91,
    "Mood=Sub|Number=Sing|Person=1|Tense=Pres": 79,
    "Mood=Sub|Number=Sing|Person=2|Tense=Fut": 84,
    "Mood=Sub|Number=Sing|Person=2|Tense=Pres": 80,
    "Mood=Sub|Number=Sing|Person=3|Tense=Fut": 51,
    "Mood=Sub|Number=Sing|Person=3|Tense=Pres": 28,
    "Number=Plur": 15,
    "Number=Plur|Degree=Cmp": 81,
    "Number=Plur|Person=1": 58,
    "Number=Plur|Person=1|VerbForm=Inf": 62,
    "Number=Plur|Person=2": 108,
    "Number=Plur|Person=2|VerbForm=Inf": 123,
    "Number=Plur|Person=3": 95,
    "Number=Plur|Person=3|VerbForm=Inf": 37,
    "Number=Sing": 17,
    "Number=Sing|Degree=Abs": 124,
    "Number=Sing|Degree=Cmp": 61,
    "Number=Sing|Person=1": 39,
    "Number=Sing|Person=1+Gender=Fem|Number=Sing|Person=3": 125,
    "Number=Sing|Person=1+Gender=Masc|Number=Sing|Person=3": 139,
    "Number=Sing|Person=1|VerbForm=Inf": 65,
    "Number=Sing|Person=2": 85,
    "Number=Sing|Person=2|VerbForm=Inf": 75,
    "Number=Sing|Person=3": 36,
    "Number=Sing|Person=3+Gender=Fem|Number=Sing|Person=3": 140,
    "Number=Sing|Person=3+Gender=Masc|Number=Sing|Person=3": 141,
    "Number=Sing|Person=3|VerbForm=Inf": 29,
    "Person=3": 12,
    "Tense=Imp|Mood=Ind|Person=1|Number=Plur": 57,
    "Tense=Imp|Mood=Ind|Person=1|Number=Sing": 40,
    "Tense=Imp|Mood=Ind|Person=2|Number=Sing": 71,
    "Tense=Imp|Mood=Ind|Person=3|Number=Plur": 24,
    "Tense=Imp|Mood=Ind|Person=3|Number=Sing": 14,
    "Tense=Imp|Mood=Sub|Person=1|Number=Plur": 86,
    "Tense=Imp|Mood=Sub|Person=1|Number=Sing": 73,
    "Tense=Imp|Mood=Sub|Person=2|Number=Sing": 88,
    "Tense=Imp|Mood=Sub|Person=3|Number=Plur": 54,
    "Tense=Imp|Mood=Sub|Person=3|Number=Sing": 34,
    "Tense=Pqp|Mood=Ind|Person=1|Number=Plur": 109,
    "Tense=Pqp|Mood=Ind|Person=1|Number=Sing": 77,
    "Tense=Pqp|Mood=Ind|Person=3|Number=Plur": 142,
    "Tense=Pqp|Mood=Ind|Person=3|Number=Sing": 31,
    "VerbForm=Ger": 19,
    "VerbForm=Inf": 8,
    "VerbForm=Part": 22,
    "_+Gender=Fem|Number=Plur": 13,
    "_+Gender=Fem|Number=Plur|Person=1": 143,
    "_+Gender=Fem|Number=Plur|Person=3": 74,
    "_+Gender=Fem|Number=Sing": 7,
    "_+Gender=Fem|Number=Sing|Person=1": 101,
    "_+Gender=Fem|Number=Sing|Person=2": 106,
    "_+Gender=Fem|Number=Sing|Person=3": 60,
    "_+Gender=Masc|Number=Plur": 11,
    "_+Gender=Masc|Number=Plur|Person=1": 96,
    "_+Gender=Masc|Number=Plur|Person=2": 126,
    "_+Gender=Masc|Number=Plur|Person=3": 56,
    "_+Gender=Masc|Number=Sing": 6,
    "_+Gender=Masc|Number=Sing|Person=1": 89,
    "_+Gender=Masc|Number=Sing|Person=2": 92,
    "_+Gender=Masc|Number=Sing|Person=3": 55,
    "_+Number=Plur|Person=1": 114,
    "_+Number=Plur|Person=2": 144,
    "_+Number=Sing|Person=1": 104,
    "_+Number=Sing|Person=2": 145,
    "_+Number=Sing|Person=3": 118
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.19.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
